app/controllers/api/users_controller.rb

    def create
        @user = User.new(user_params)
        @user.photo.attach(io: open("https://fotobox-seeds.s3-us-west-1.amazonaws.com/image_assets/lightbox_favicon.svg"), filename: "lightbox_favicon.svg" )
        @user.bio = ""
        if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"